/**
 © Copyright 2018, The Great Rift Valley Software Company. All rights reserved.
 
 This code is proprietary and confidential code,
 It is NOT to be reused or combined into any application,
 unless done so, specifically under written license from The Great Rift Valley Software Company.
 
 The Great Rift Valley Software Company: https://riftvalleysoftware.com
 */
/* ###################################################################################################################################### */
/**
 */
/* GENERAL STUFF */

"TIME-HOUR" = "1 hora";
"TIME-HOURS-FORMAT" = "%d horas";
"TIME-MINUTE" = "1 minuto";
"TIME-MINUTES-FORMAT" = "%d minutos";
"TIME-SECOND" = "1 segundo";
"TIME-SECONDS-FORMAT" = "%d segundos";

/* INFO STRING */

"NSAppleMusicUsageDescription" = "Reproducir música como alarma"; // This is the string we use to ask permission to get ath the user's music collection.

/* TABS */

"LGV_TIMER-SETUP-TITLE" = "Lista de temporizadores"; // The tab title for the main timer list tab.
"LGV_TIMER-TIMER-TITLE-FORMAT" = "Temporizador %d"; // A Format for each timer tab title. The "%d" is replaced by the integer index of the timer (1-based).

/* TIMER LIST SCREEN */
// Shorthened to simply "Show Timer Controls."
"LGV_TIMER-ABOUT-SHOWCONTROLS-BUTTON" = "Mostrar controles del temporizador"; // en el temporizador en curso"; // This is the text for the button next to the running controls switch in the timer list screen.

/* TIMER LIST DELETE CONFIRMATION */

"DELETE-HEADER" = "¿Seguro?"; // The header.
"DELETE-MESSAGE-FORMAT" = "Si eliges “Eliminar”, se eliminará el Temporizador %d. ¿Seguro que quieres hacer esto?"; // The explanatory text.
"DELETE-OK-BUTTON" = "Eliminar"; // The Delete Button
"DELETE-CANCEL-BUTTON" = "Cancelar"; // The cancel button.

/* TIMER SCREEN */

"NO-TIMER" = "Ningún temporizador siguiente"; // This is displayed in the following timer pickerView for no timer.
"NEXT-TIMER-TIMER-FORMAT" = "Siguiente temporizador: temporizador %d"; // This is displayed when there is a timer selected as the next one.
"CANT-SELECT" = "NO DISPONIBLE"; // This is displayed in the picker for the current timer.

/* TIMER SETTINGS SCREEN */

"LGV_TIMER-SETUP-WARNING-SET-LABEL" = "Hora de advertencia (amarillo) en modo podio"; // The title for the warning time picker in the settings screen.
"LGV_TIMER-SETUP-FINAL-SET-LABEL" = "Hora final (rojo) en modo podio"; // The title for the final time picker in the settings screen.
"LGV_TIMER-SETUP-COLOR-THEME-LABEL" = "Color de pantalla digital"; // The title for the display color picker in the timer settings screen.

"LGV_TIMER-TIME-PICKER-HOUR-FORMAT" = "%d hora"; // The picker uses custom components, instead of a standard system picker. If there is only one hour, this is used.
"LGV_TIMER-TIME-PICKER-HOURS-FORMAT" = "%d horas"; // The picker uses custom components, instead of a standard system picker. If more than one hour, this is used.
"LGV_TIMER-TIME-PICKER-MINUTE-FORMAT" = "%d minuto"; // The picker uses custom components, instead of a standard system picker. If there is only one minute, this is used.
"LGV_TIMER-TIME-PICKER-MINUTES-FORMAT" = "%d minutos"; // The picker uses custom components, instead of a standard system picker. If more than one minute, this is used.
"LGV_TIMER-TIME-PICKER-SECOND-FORMAT" = "%d segundo"; // The picker uses custom components, instead of a standard system picker. If there is only one second, this is used.
"LGV_TIMER-TIME-PICKER-SECONDS-FORMAT" = "%d segundos"; // The picker uses custom components, instead of a standard system picker. If more than one second, this is used.

/* ALARM SETUP SCREEN */

"LOCAL-VIBRATE-BEEP-SWITCH" = "VIBRAR"; // This is the text for the button next to the vibrate switch. Hidden for iPad.
"LOCAL-NO-MUSIC-LABEL" = "No hay música disponible"; // This is displayed if there is no music available for selection.
"BASIC-DONE-BUTTON" = "LISTO"; // The done button (used in both the timer settings and alarm settings screens).
"LOCAL-MUSIC-LOOKUP-LABEL" = "Buscando en tu biblioteca musical"; // This is displayed while the throbber is up, while the music is being fetched.
"LGV_TIMER-AUDIBLE-TICKS-BUTTON" = "BIPS SONOROS"; // This is the text for the button and switch that select whether or not an audible "tick" sound occurs for a running timer.

/* SOUND NAMES */

"00-low-beep.mp3" = "Bips simples volumen bajo";
"01-medium-beep.mp3" = "Bips simples volumen medio";
"02-high-beep.mp3" = "Bips simples volumen alto";
"03-electronic-buzz.mp3" = "Bips estridentes";
"04-fast-beep.mp3" = "Sonido delicado";
"05-high-fast-beeps.mp3" = "Bips delicados rápidos";
"06-escalation.mp3" = "Alarma intensificada";
"07-videogame-beeps-lower-frequency.mp3" = "Electrónicos de baja frecuencia";
"08-videogame-beeps-high-frequency.mp3" = "Electrónicos de alta frecuencia";
"09-single-beep.mp3" = "Bips básicos";
"10-annoying-alarm.mp3" = "Alarma clásica";
"11-bells.mp3" = "Campanas de iglesia";
"12-crazy-bird.mp3" = "Pájaro loco";
"13-rooster.mp3" = "Gallo";
"16-snoring-1.mp3" = "Ronquidos";
"17-car-horn.mp3" = "Claxon";
"18-antique-phone.mp3" = "Sonido de teléfono antiguo";
"19-classic-phone.mp3" = "Sonido de teléfono clásico";
"20-antique-car-horn.mp3" = "Claxon de automóvil antiguo";
"21-alarm-klaxon.mp3" = "Alarma";

"14-shut-up-1.mp3" = "Cállate (hombre molesto)"; // ONLY USED FOR ENGLISH
"15-shut-up-2.mp3" = "Cállese (mujer)"; // ONLY USED FOR ENGLISH
"22-thanks-for-sharing.mp3" = "Gracias por compartir (voz de robot)"; // ONLY USED FOR ENGLISH

/* ERROR DIALOG */

"ERROR_HEADER_MEDIA" = "ERROR DE MEDIOS DEL DISPOSITIVO"; // The header for media error alerts.
"ERROR_TEXT_MEDIA_PERMISSION_DENIED" = "No tienes permitido leer cualquier medio desde este dispositivo."; // No permission alert text.
"ERROR_TEXT_MEDIA_CANNOT_CREATE_AVPLAYER" = "Hubo un problema técnico en la creación del reproductor de sonido."; // Unknown technical error alert text.
"BASIC-OK-BUTTON" = "OK"; // Alert OK button.

/* INFO SCREEN */

"LGV_TIMER-ABOUT-TEXT" = "AmbiaMara es el mejor temporizador regresivo.\nTiene tres modos: digital (solo números), podio (tres “semáforos” simples) y dual (dígitos y “semáforos”).\nAñade temporizadores mediante el signo “+” en la parte superior derecha de la lista de temporizadores y elimínalos deslizando el temporizador de la lista hacia la izquierda.";

/* ACCESSIBILITY */
/* TIMER LIST SCREEN */


"LGV_TIMER-ACCESSIBILITY-INFO-LABEL" = "Abrir \"Acerca de esta aplicación\"";
"LGV_TIMER-ACCESSIBILITY-INFO-HINT" = "Si seleccionas este botón, se mostrará la pantalla de información de la aplicación.";
"LGV_TIMER-ACCESSIBILITY-ADD-LABEL" = "Crear un nuevo temporizador";
"LGV_TIMER-ACCESSIBILITY-ADD-HINT" = "Si seleccionas esta opción, se añadirá un nuevo temporizador predeterminado al final de la lista y se seleccionará su pantalla de configuración.";

"LGV_TIMER-ACCESSIBILITY-TABLE-LABEL" = "Lista de todos los temporizadores disponibles";
"LGV_TIMER-ACCESSIBILITY-TABLE-HINT" = "Cada fila de esta tabla representa un solo temporizador. Puedes seleccionar un temporizador pulsando en esa fila o eliminarlo deslizando la fila hacia la izquierda.";

"LGV_TIMER-ACCESSIBILITY-SWITCH-LABEL" = "Mostrar controles del temporizador sobre el temporizador en curso";
"LGV_TIMER-ACCESSIBILITY-SWITCH-HINT" = "Si este interruptor está activado, cada temporizador, cuando se ejecuta, mostrará una fila de controles sobre el temporizador con botones de control. Si no se muestran, el temporizador debe estar controlado por gestos.";

/* Labels for each row -dependent upon mode. These will also be displayed in the other screens. */

"LGV_TIMER-ACCESSIBILITY-TABLE-ROW-PODIUM-LABEL" = "Temporizador en modo podio";
"LGV_TIMER-ACCESSIBILITY-TABLE-ROW-PODIUM-HINT" = "Este temporizador mostrará tres “semáforos” que cambiarán de verde (más a la izquierda) a amarillo (centro), a rojo (más a la derecha) a medida que el temporizador hace una cuenta regresiva. Se producirá un parpadeo en cada transición.";
"LGV_TIMER-ACCESSIBILITY-TABLE-ROW-DIGITAL-LABEL" = "Temporizador en modo digital";
"LGV_TIMER-ACCESSIBILITY-TABLE-ROW-DIGITAL-HINT" = "Este temporizador mostrará una lectura digital simple en el color seleccionado.";
"LGV_TIMER-ACCESSIBILITY-TABLE-ROW-DUAL-LABEL" = "Temporizador en modo dual";
"LGV_TIMER-ACCESSIBILITY-TABLE-ROW-DUAL-HINT" = "Este temporizador mostrará una lectura digital en el color seleccionado. Debajo de la lectura podrás ver tres “semáforos” que cambiarán de verde (más a la izquierda) a amarillo (centro), a rojo (más a la derecha) a medida que el temporizador hace una cuenta regresiva. Se producirá un parpadeo en cada transición.";

/* TIMER SET SCREEN */

"LGV_TIMER-ACCESSIBILITY-PICKER-HOURS-TITLE-LABEL" = "Establecer horas. Actualmente en ";
"LGV_TIMER-ACCESSIBILITY-PICKER-MINUTES-TITLE-LABEL" = "Establecer minutos. Actualmente en ";
"LGV_TIMER-ACCESSIBILITY-PICKER-SECONDS-TITLE-LABEL" = "Establecer segundos. Actualmente en ";

"LGV_TIMER-ACCESSIBILITY-SETTINGS-BUTTON-LABEL" = "Ajustes del temporizador";
"LGV_TIMER-ACCESSIBILITY-SETTINGS-BUTTON-HINT" = "Al pulsar este botón, aparecerá una pantalla que te permitirá configurar este temporizador.";

"LGV_TIMER-ACCESSIBILITY-SETTINGS-BUTTON-LABEL" = "Ajustes del temporizador";
"LGV_TIMER-ACCESSIBILITY-SETTINGS-BUTTON-HINT" = "Al pulsar este botón, aparecerá una pantalla que te permitirá configurar este temporizador.";

"LGV_TIMER-ACCESSIBILITY-SETTINGS-BUTTON-LABEL" = "Ajustes del temporizador";
"LGV_TIMER-ACCESSIBILITY-SETTINGS-BUTTON-HINT" = "Al pulsar este botón, aparecerá una pantalla que te permitirá configurar este temporizador.";

"LGV_TIMER-ACCESSIBILITY-NEXT-TIMER-PICKER-LABEL" = "Siguiente temporizador";
"LGV_TIMER-ACCESSIBILITY-NEXT-TIMER-PICKER-HINT" = "Permite elegir un temporizador que se seleccionará inmediatamente después de detener la alarma. Aparecerá la pantalla Establecer temporizador para el siguiente temporizador y podrás iniciar ese temporizador.";

"LGV_TIMER-ACCESSIBILITY-NEXT-TIMER-PICKER-COLUMN-LABEL" = "Permite elegir otro temporizador para ser seleccionado tras detener la alarma para este temporizador. Puedes seleccionar ningún temporizador siguiente o uno de los otros temporizadores.";

"LGV_TIMER-ACCESSIBILITY-TIMER-START-BUTTON-LABEL" = "Iniciar temporizador";
"LGV_TIMER-ACCESSIBILITY-TIMER-START-BUTTON-HINT" = "Al pulsar este botón se iniciará el temporizador. Aparecerá una pantalla con el indicador necesario para el modo de temporizador seleccionado. El temporizador comenzará inmediatamente la cuenta regresiva.";

/* TIMER SETTINGS SCREEN */

"LGV_TIMER-ACCESSIBILITY-SEGMENTED-TIMER-MODE-Digits-LABEL" = "Modo digital. El temporizador mostrará una pantalla digital simple durante la cuenta regresiva.";
"LGV_TIMER-ACCESSIBILITY-SEGMENTED-TIMER-MODE-Lights-LABEL" = "Modo podio. El temporizador mostrará tres “semáforos” simples durante la cuenta regresiva.";
"LGV_TIMER-ACCESSIBILITY-SEGMENTED-TIMER-MODE-Both-LABEL" = "Modo dual. El temporizador mostrará dígitos durante la cuenta regresiva y, debajo de los dígitos, habrá tres “semáforos” simples.";

"LGV_TIMER-ACCESSIBILITY-COLOR-PICKER-LABEL" = "Color de pantalla digital";
"LGV_TIMER-ACCESSIBILITY-COLOR-PICKER-HINT" = "Este selector tiene una columna de colores. Puedes seleccionar un color, que es el que se utilizará para los modos digital y dual. No estará disponible para el modo podio.";

"LGV_TIMER-ACCESSIBILITY-SET-WARN-TIME-PICKER-LABEL" = "Establecer tiempo de advertencia";
"LGV_TIMER-ACCESSIBILITY-SET-WARN-TIME-PICKER-HINT" = "El selector a continuación tiene tres columnas: horas (más a la izquierda), minutos (centro) y segundos (más a la derecha). Úsalos para seleccionar el tiempo de “advertencia” para la cuenta regresiva. Puedes seleccionar hasta 23:59:59.";

"LGV_TIMER-ACCESSIBILITY-SET-FINAL-TIME-PICKER-LABEL" = "Establecer tiempo final";
"LGV_TIMER-ACCESSIBILITY-SET-FINAL-TIME-PICKER-HINT" = "El selector a continuación tiene tres columnas: horas (más a la izquierda), minutos (centro) y segundos (más a la derecha). Úsalos para seleccionar el tiempo “final” para la cuenta regresiva. Puedes seleccionar hasta 23:59:59.";

"LGV_TIMER-ACCESSIBILITY-ALARM-SETUP-BUTTON-LABEL" = "Configuración de sonido";
"LGV_TIMER-ACCESSIBILITY-ALARM-SETUP-BUTTON-HINT" = "Este botón mostrará imágenes que indicarán el modo actual de sonido/vibración de alarma. Si pulsas este botón, aparecerá una pantalla que permitirá establecer el estado de sonido y vibración de la alarma.";

"LGV_TIMER-ACCESSIBILITY-SOUND-SET" = "La alarma reproducirá un sonido.";
"LGV_TIMER-ACCESSIBILITY-SONG-SET" = "La alarma reproducirá una canción.";
"LGV_TIMER-ACCESSIBILITY-SILENT-SET" = "La alarma se silenciará en modo alarma.";
"LGV_TIMER-ACCESSIBILITY-VIBRATE-SET" = "El teléfono vibrará en modo alarma.";
"LGV_TIMER-ACCESSIBILITY-TICKS-SET" = "Oirás bips sonoros.";

"LGV_TIMER-ACCESSIBILITY-DONE-BUTTON-LABEL" = "Listo";
"LGV_TIMER-ACCESSIBILITY-DONE-BUTTON-HINT" = "Si pulsas este botón, se descartará esta pantalla.";

/* ALARM SETUP SCREEN */

"LGV_TIMER-ACCESSIBILITY-VIBRATE-SWITCH-LABEL" = "Vibrar con la alarma";
"LGV_TIMER-ACCESSIBILITY-VIBRATE-SWITCH-HINT" = "Si este interruptor está activado, el teléfono vibrará cuando suene la alarma.";

"LGV_TIMER-ACCESSIBILITY-SEGMENTED-AUDIO-MODE-Speaker-LABEL" = "Reproducir sonido seleccionado. Al finalizar, el temporizador reproducirá un sonido que debes seleccionar en el selector a continuación.";
"LGV_TIMER-ACCESSIBILITY-SEGMENTED-AUDIO-MODE-Music-LABEL" = "Reproducir canción seleccionada. Al finalizar, el temporizador reproducirá una canción que debes seleccionar de tu biblioteca musical con los siguientes selectores.";
"LGV_TIMER-ACCESSIBILITY-SEGMENTED-AUDIO-MODE-Nothing-LABEL" = "Silenciada. No habrá alarma sonora al finalizar el temporizador.";

"LGV_TIMER-ACCESSIBILITY-SOUND-SELECT-PICKER-LABEL" = "Seleccionar un sonido";
"LGV_TIMER-ACCESSIBILITY-SOUND-SELECT-PICKER-HINT" = "Selecciona uno de los varios sonidos predefinidos para reproducir cuando suene la alarma.";

"LGV_TIMER-ACCESSIBILITY-ARTIST-SELECT-PICKER-LABEL" = "Selecciona un artista de tu biblioteca musical";
"LGV_TIMER-ACCESSIBILITY-ARTIST-SELECT-PICKER-HINT" = "Selecciona un artista de tu biblioteca musical. Al seleccionar un artista, el selector que está debajo mostrará tus canciones.";
"LGV_TIMER-ACCESSIBILITY-SONG-SELECT-PICKER-LABEL" = "Elige una canción del artista anterior";
"LGV_TIMER-ACCESSIBILITY-SONG-SELECT-PICKER-HINT" = "Selecciona una canción del artista en el selector de arriba.";

"LGV_TIMER-ACCESSIBILITY-TEST-SOUND-BUTTON-LABEL" = "Sonido de prueba";
"LGV_TIMER-ACCESSIBILITY-TEST-SOUND-BUTTON-HINT" = "Al tocar este botón se iniciará la reproducción del sonido seleccionado en bucle. Tócalo de nuevo para evitar que se reproduzca el sonido.";

"LGV_TIMER-ACCESSIBILITY-TEST-SONG-BUTTON-LABEL" = "Canción de prueba";
"LGV_TIMER-ACCESSIBILITY-TEST-SONG-BUTTON-HINT" = "Al tocar este botón se iniciará la reproducción de la canción seleccionada en bucle. Tócalo de nuevo para evitar que se reproduzca la canción.";

"LGV_TIMER-ACCESSIBILITY-AUDIBLE-TICKS-SWITCH-LABEL" = "Activar bips sonoros";
"LGV_TIMER-ACCESSIBILITY-AUDIBLE-TICKS-SWITCH-HINT" = "Si activas este interruptor, cada segundo estará marcado por un sonido de \"bip\" sutil. En el modo podio o dual, escucharás dos bips cuando estás en el modo “Advertencia” y tres bips cuando estás en el modo “Final”.";

/* RUNNING TIMER SCREEN */

"LGV_TIMER-ACCESSIBILITY-STOP-BUTTON-LABEL" = "Detener temporizador";
"LGV_TIMER-ACCESSIBILITY-STOP-BUTTON-HINT" = "Al tocar este botón, se detendrá el temporizador y se descartará la pantalla.";

"LGV_TIMER-ACCESSIBILITY-REWIND-BUTTON-LABEL" = "Restablecer temporizador";
"LGV_TIMER-ACCESSIBILITY-REWIND-BUTTON-HINT" = "Al tocar este botón, se detendrá el temporizador y se volverá al principio. No se descartará la pantalla.";

"LGV_TIMER-ACCESSIBILITY-END-BUTTON-LABEL" = "Detener temporizador";
"LGV_TIMER-ACCESSIBILITY-END-BUTTON-HINT" = "Al tocar este botón, se detendrá el temporizador y se activará la alarma. No se descartará la pantalla.";

"LGV_TIMER-ACCESSIBILITY-PAUSE-BUTTON-LABEL" = "Pausar temporizador";
"LGV_TIMER-ACCESSIBILITY-PAUSE-BUTTON-HINT" = "Al pulsar esta opción se pausará el temporizador. Si está en el modo podio, el temporizador también volverá al inicio.";

"LGV_TIMER-ACCESSIBILITY-START-BUTTON-LABEL" = "Iniciar o continuar temporizador";
"LGV_TIMER-ACCESSIBILITY-START-BUTTON-HINT" = "Al pulsar esta opción se iniciará o continuará un temporizador en pausa.";

"LGV_TIMER-ACCESSIBILITY-SCREEN-LABEL" = "Pantalla de temporizador en curso";
"LGV_TIMER-ACCESSIBILITY-SCREEN-HINT" = "Esta es la pantalla del temporizador en curso. Puede ser controlado por gestos. Desliza a la izquierda para restablecer el temporizador o descartar esta pantalla (si el temporizador ya se ha restablecido). Desliza hacia la derecha para pasar el temporizador al modo de alarma. Toca para pausar o continuar el temporizador.";

"LGV_TIMER-ACCESSIBILITY-ALARM-LABEL" = "La alarma está sonando";
"LGV_TIMER-ACCESSIBILITY-ALARM-HINT" = "La alarma está sonando. Toca en cualquier parte de la pantalla para detenerla.";
